Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/studying_in_ireland/education_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Whether you are a parent, a student or an adult wishing to return to education, it is useful for you to become familiar with the Irish education system
ga: Cibé acu más tuismitheoir, mac léinn nó duine fásta thú ar mian leat filleadh ar oideachas, is áisiúil duit cur amach a bheith agat ar chóras oideachais na hÉireann

source: Whatever area of education you wish to pursue for yourself or for your child, it is important to find out as much as possible about the options that are open to you
ga: Pé limistéar oideachais is mian leat tabhairt faoi duit féin nó do do leanbh, is tábhachtach duit a mhéid is féidir a dheimhniú faoi na roghanna atá ar fáil duit

source: On the Department of Education and Skills website you can find information about education in Ireland and a guide for parents to the Irish education system (pdf)
ga: Ar láithreán gréasáin na Roinne Oideachais agus Scileanna is féidir leat teacht ar fhaisnéis faoi oideachas in Éirinn agus ar threoir do thuismitheoirí maidir le córas oideachais na hÉireann (pdf)

source: Pre-school education is usually provided by privately funded childcare facilities or providers
ga: Is gnách go soláthraíonn áiseanna nó soláthróirí cúram leanaí a chistítear go príobháideach oideachas réamhscoile

source: The Early Childhood Care and Education (ECCE) Scheme provides early childhood care and education for children of pre-school age
ga: Soláthraíonn an Scéim um Chúram agus Oideachas na Luath-Óige (COLO) cúram agus oideachas luath-óige do leanaí ar aois naíonra

source: At primary and post-primary level, there are different types of schools including multi-denominational and co-educational schools
ga: Ar leibhéal bunscoile agus iar-bhunscoile, tá saghsanna éagsúla de scoileanna ann, lena n-áirítear scoileanna il-sainchreidmheacha agus comhoideachais

source: You can also choose from schools that teach the curriculum through Irish (Gaelscoileanna). You can read more information in our documents, Moving your child to an Irish primary school and Moving your child to an Irish secondary school
ga: Féadfaidh tú rogha a dhéanamh, chomh maith, ar scoileanna a mhúineann an curaclam trí Ghaeilge (Gaelscoileanna) Féadfaidh tú níos mó faisnéise a léamh inár gcáipéisí, Do pháiste a aistriú chuig bunscoil in Éirinn agus Do pháiste a aistriú chuig meánscoil in Éirinn

source: If you are moving to Ireland for third-level education, there is a range of third-level options; universities, institutes of technologies and the colleges of education are substantially funded by the State
ga: Má tá tú ag teacht go hÉirinn le freastal ar oideachas tríú leibhéal, tá réimse de roghanna tríú leibhéal ann; ollscoileanna, institiúidí teicneolaíochta agus coláistí oideachais a fhaigheann cistiú mór ón Stát

source: In addition there are a number of independent private colleges
ga: Chomh maith leis sin, tá líon coláistí príobháideacha neamhspleácha ann

source: Further education comprises education and training which takes place after second-level schooling but which is not part of the third-level system
ga: Is éard atá i gceist le breisoideachas ná oideachas agus oiliúint a chuirtear ar bun i ndiaidh scolaíocht dara leibhéal, ach nach bhfuil mar chuid den chóras tríú leibhéal

source: It includes programmes such as Post-Leaving Certificate courses; the Vocational Training Opportunities Scheme (second-chance education for the unemployed); programmes in Youthreach for early school-leavers; other literacy and basic education; and self-funded evening adult programmes in second-level schools
ga: Áirítear leo cláir ar nós cúrsaí Iar-Ardteistiméireachta; an Scéim Deiseanna Oiliúna Gairmoideachais (oideachas athdheise do dhaoine dífhostaithe); cláir in Ógtheagmháil do luathfhágóirí scoile, litearthacht agus bunoideachas eile; cláir féinchistithe thráthnóna do dhaoine fásta i scoileanna dara leibhéal

source: There are opportunities for adults who wish to return to education or continue their education on a full-time or part-time basis
ga: Tá roghanna ann do dhaoine fásta ar mian leo filleadh ar oideachas nó leanúint lena n-oideachas ar bhonn lánaimseartha nó páirtaimseartha

source: State-funded education is available at primary and post-primary levels, so you will not have to pay fees unless you choose to send your child to a private school
ga: Tá oideachas atá cistithe ag an Stát ar fáil ar leibhéil bhunscoile agus iar-bhunscoile, mar sin, ní bheidh ort táillí a íoc mura roghnaíonn tú chun do leanbh a chur chuig scoil phríobháideach

source: Pre-schools are generally run on a private and fee-paying basis, though there may be some State help in certain circumstances
ga: Is gnách go reáchtáiltear naíonraí ar bhonn príobháideach agus táillí, cé go bhféadfadh roinnt cabhrach a bheith le fáil ón Stát faoi chúinsí áirithe

source: You will have to pay fees for third-level education unless you qualify for "free fees"
ga: Beidh ort táillí a íoc as oideachas tríú leibhéal mura gcáilíonn tú do “shaortháillí"
